<?php

return [
    'parking_spot_capacity' => [
        1 => '5台未満',
        2 => '6~20台',
        3 => '21台以上',
        4 => '不明',
    ],
    'parking_spot_rate_day_types' => [
        '全日' => '全日',
        '平日' => '平日',
        '土日祝' => '土日祝',
    ],
    'parking_spot_business_hour_day_types' => [
        '全日' => '全日',
        '平日' => '平日',
        '土日祝' => '土日祝',
        '月曜' => '月曜',
        '火曜' => '火曜',
        '水曜' => '水曜',
        '木曜' => '木曜',
        '金曜' => '金曜',
        '土曜' => '土曜',
        '日曜' => '日曜',
    ],
    'parking_spot_rate_unit_minutes' => [
        12 => '12分',
        15 => '15分',
        20 => '20分',
        30 => '30分',
        60 => '60分',
        90 => '90分',
        120 => '2時間',
        180 => '3時間',
        240 => '4時間',
        300 => '5時間',
        720 => '12時間',
        1440 => '24時間',
    ],
    'parking_spot_max_rate_periods' => [
        'entry_24_hours' => '入庫から24時間',
        'entry_custom_hours' => '入庫から指定時間',
        'until_midnight' => '当日24時まで',
        'until_rate_period_ends' => '料金時間帯の終了まで',
    ],
];
